{
  "name": "Juliano Maia",
  "title": "Tech Lead / Principal Software Engineer",
  "summary": "With over 20 years of diverse experience in leading teams and companies to deliver software that improve people's lives, I am a self-driven, communicative leader passionate about learning, innovation, and team development. I am dedicated to mentoring and upskilling engineers with a people-first approach. In my free time, I volunteer, create music, and play padel (racket sport) competitively.",
  "contact": {
    "phone": "678-643-0950",
    "email": "julianosam@gmail.com",
    "linkedin": "https://www.linkedin.com/in/julianosam",
    "location": "Austin, TX, 78745"
  },
  "education": [
    {
      "degree": "Masters in CS - Machine Learning",
      "institution": "Georgia Institute of Technology",
      "location": "Remote",
      "year": "2024"
    },
    {
      "degree": "Bachelors in Computer Science",
      "institution": "PUCRS",
      "location": "Porto Alegre, Brazil",
      "year": "2010"
    }
  ],
  "certifications": [
    {
      "title": "Java Spring 4.3 Certified Professional",
      "issuer": "Pivotal",
      "year": "2017"
    }
  ],
  "skills": [
    "Java",
    "Java/Spring",
    "Typescript/NodeJS",
    "Python/Django",
    "Architecture/Design",
    "REST/GraphQL/gRPC",
    "SaaS/PaaS/SOA",
    "Microservices",
    "Kafka/Redis/SQS",
    "Docker/Kubernetes",
    "AWS/GCP/Cloud",
    "Angular/React",
    "Kotlin/Android/iOS",
    "SQL/MySQL/Oracle",
    "NoSQL/Mongo",
    "Linux/Embedded",
    "C/C++"
  ],
  "experience": [
    {
      "title": "Principal Software Engineer",
      "company": "Snaplogic Inc",
      "location": "",
      "start_date": "Jan 2024",
      "end_date": "PRESENT",
      "responsibilities": [
        "Leading an innovation team of 5 engineers integrating GenAI  APIs in 3 different platforms, using Java and Python.",
        "Built a no-code interface in React.js that allows customers to visually create ETL data pipelines, increasing adoption in 200% and reducing costs for both clients and company."
      ]
    },
    {
      "title": "Tech Lead/Software Engineer (L5)",
      "company": "Seesaw Learning Inc.",
      "location": "Remote, United States",
      "start_date": "Sep 2022",
      "end_date": "Apr 2023",
      "responsibilities": [
        "Led frontend reconstruction, consolidating 3 codebases into an efficient Typescript/React app deployed on iOS, Android, and web platforms, working with PMs to align the roadmaps across 5 feature teams.",
        "Built custom REST APIs for the Customer Experience team, gathering requirements, setting accurate expectations and ensuring successful delivery of technical projects.",
        "Conducted code reviews, ensuring high code quality, and provided constructive feedback to maintain coding standards.",
        "Implemented automatic folder structure generator for classes, tripling adoption and showcasing a strong product mindset."
      ]
    },
    {
      "title": "Principal Software Engineer",
      "company": "Automatic Data Processing (ADP)",
      "location": "Atlanta, GA, United States",
      "start_date": "Jan 2013",
      "end_date": "Sep 2021",
      "responsibilities": [
        "Led the transformation of 20+ legacy payroll systems to a modern Java/Spring Boot microservices architecture, resulting in a 60% reduction in maintenance costs.",
        "Designed and implemented a data pipeline for the Transparency system enabling post-payroll analysis and AI-driven insights, reducing errors and debugging time.",
        "Set the long-term technical vision for Payroll Transparency and API integrations.",
        "Championed the adoption of Test Driven Design (TDD) and Behavior Driven Design (BDD) in ADP’s Agile processes, ensuring a seamless continuous delivery.",
        "Reviewed the technical design across 12 global teams within ADP's architecture board.",
        "Developed ADP's first chatbot integrating 15+ Payroll APIs with the ADP’s mobile app for employee self-service, reducing support calls by 40%.",
        "Launched a micro-UI platform for web and mobile using Angular and Typescript, empowering federated teams to develop modules across 10+ products in 3 countries.",
        "Functionally managed a cross-functional team of 6 developers and 1 QA engineer.",
        "Conducted technical interviews and onboarded over 50 engineers for 10+ teams."
      ]
    },
    {
      "title": "Staff Embedded Architect/Manager",
      "company": "Synergy Embedded",
      "location": "Porto Alegre, Brazil",
      "start_date": "Feb 2012",
      "end_date": "Jan 2015",
      "responsibilities": [
        "Architected a Smart Street Light system for a startup that leveraged Zigbee mesh networks and LED street lamps, reducing energy consumption by 40%.",
        "Hired and managed 10+ software engineers helping build teams from the ground up.",
        "Authored a framework in C++ for code simulation on the PC, reducing testing cost by 60%.",
        "Shortened maintenance response time building a web monitoring and configuration application in Node.js."
      ]
    },
    {
      "title": "Senior Software Engineer",
      "company": "T&T Engenheiros",
      "location": "Porto Alegre, Brazil",
      "start_date": "Aug 2011",
      "end_date": "Feb 2012",
      "responsibilities": [
        "Pioneered a computer vision system for audience evaluation and customized content display, in partnership with H&P Brazil, written in C++, for live video processing and audience information extraction."
      ]
    },
    {
      "title": "Embedded Systems Engineer",
      "company": "Digitel S/A",
      "location": "Porto Alegre, Brazil",
      "start_date": "Apr 2008",
      "end_date": "Aug 2011",
      "responsibilities": [
        "Coded firmware for 20+ enterprise network devices such as modems, routers, and switches in C/C++.",
        "Solved IPC issues by building a secure messaging library in C++, improving firmware reliability.",
        "Ported the Linux kernel to a re-usable PowerPC architecture reducing the time-to-market from 8 to 3 months.",
        "Reduced production costs by developing a firmware test suite on PCs using Linux VMs."
      ]
    },
    {
      "title": "Co-Founder and CEO",
      "company": "Powertech Informatica",
      "location": "Triunfo, Brazil",
      "start_date": "Dec 2004",
      "end_date": "Dec 2005",
      "responsibilities": [
        "Assembled and sold computers and laptops for personal and commercial use, including government institutions via bids and contracts with the city government.",
        "Performed on-site technical support for local businesses, offering monthly subscriptions for recurrent customers.",
        "Coded the e-commerce website using Java/JSP, Tomcat and MySQL.",
        "Mentored 2 interns on making efficient hardware and software repairs on customers’ PCs."
      ]
    }
  ]
}