{
  "id": "aspira-principal-back-end-engineer",
  "company": "Aspira",
  "title": "Principal Back End Engineer",
  "originalUrl": "https://recruit.hirebridge.com/v3/Jobs/JobDetails.aspx?cid=7025&jid=599153&locvalue=1362&request_id=771120",
  "jobSummary": "As a Principal Back End Engineer at Aspira, you will be a key technical leader within our engineering team, driving the design, development, and optimization of robust back-end systems that are crucial to the company’s operational success and scalability. This role combines in-depth coding expertise, architectural design, and strategic leadership, ensuring that all back-end solutions are scalable, efficient, and aligned with both technical and business objectives. The Principal Back End Engineer will collaborate with cross-functional teams, mentor junior engineers, and play a critical role in shaping the technical roadmap for our back-end infrastructure.",
  "responsibilities": [
    "Lead the design and development of scalable, high-performance back-end services and APIs, ensuring seamless integration with front-end systems and third-party applications.",
    "Optimize back-end build pipelines and deployment processes, enhancing system performance, reducing technical debt, and improving overall operational efficiency.",
    "Define and implement a comprehensive testing strategy for back-end systems, including unit, integration, and load testing, to ensure robust code quality and system reliability.",
    "Collaborate with security teams to identify and address potential vulnerabilities, incorporating security best practices into the back-end development lifecycle to protect data and maintain compliance.",
    "Oversee the architectural design and deployment of back-end solutions, ensuring they meet both technical and business requirements for scalability, performance, and reliability.",
    "Work closely with product managers, front-end engineers, and other stakeholders to define the technical roadmap and align back-end development with the company's broader product strategy.",
    "Mentor and guide back-end engineers, fostering a culture of continuous learning, innovation, and technical excellence within the team.",
    "Drive technical discussions and decision-making processes, offering expertise on back-end architecture, design patterns, and industry best practices.",
    "Conduct thorough code reviews, ensuring adherence to coding standards and the delivery of maintainable, scalable back-end solutions.",
    "Take ownership of complex back-end projects, managing timelines and proactively identifying and addressing potential risks or issues to ensure timely and successful delivery.",
    "Stay informed about industry trends, emerging technologies, and best practices, applying this knowledge to continuously improve the company's back-end infrastructure.",
    "Contribute to the evolution of back-end development processes by introducing new tools, methodologies, and practices to enhance team efficiency and software quality.",
    "Collaborate with cross-functional teams to troubleshoot and resolve complex technical issues, ensuring high system reliability and performance across all applications.",
    "Represent and embody the company culture, promoting teamwork, transparent communication, and accountability in all interactions.",
    "Promote business policies and procedures, the quality of its products and reputation, and consistently support compliance and all applicable regulatory initiatives by maintaining the privacy and confidentiality of information, protecting the assets of the organization, acting with ethics and integrity, reporting non-compliance, and adhering to applicable federal, state, and local laws and regulations, and the company's policies and procedures."
  ],
  "requirements": [
    "Bachelor’s degree in Computer Science, Engineering, or a related field; Master’s degree preferred.",
    "10+ years of experience in back-end development, with a strong emphasis on serverless architecture and cloud-based solutions.",
    "Extensive experience with AWS services, including but not limited to CloudFront, S3, DynamoDB, AppSync, Lambda, EventBridge, and StepFunctions.",
    "Proficiency in programming languages such as Python, JavaScript (Node.js), or similar.",
    "Strong understanding of database design and management, both relational and NoSQL.",
    "Demonstrated experience in leading technical teams and mentoring junior engineers.",
    "Excellent problem-solving skills and the ability to troubleshoot complex issues.",
    "Strong communication skills, with the ability to articulate complex technical concepts to both technical and non-technical stakeholders.",
    "Experience with CI/CD pipelines and DevOps practices.",
    "Familiarity with front-end technologies and how they integrate with back-end services.",
    "Proven ability to work in a fast-paced, agile development environment.",
    "Strong understanding of security best practices in back-end development.",
    "Experience with API design and development, including RESTful and GraphQL APIs.",
    "Ability to manage multiple projects simultaneously and meet deadlines.",
    "Commitment to continuous learning and staying updated with industry trends."
  ],
  "technologies": [
    "AWS CloudFront",
    "AWS S3",
    "AWS DynamoDB",
    "AWS AppSync",
    "AWS Lambda",
    "AWS EventBridge",
    "AWS StepFunctions",
    "Python",
    "JavaScript",
    "Node.js",
    "CI/CD pipelines",
    "DevOps practices",
    "RESTful APIs",
    "GraphQL APIs"
  ],
  "softSkills": [
    "Leadership",
    "Mentoring",
    "Problem-solving",
    "Communication",
    "Team collaboration",
    "Time management",
    "Adaptability",
    "Continuous learning"
  ],
  "hardSkills": [
    "Back-end development",
    "Serverless architecture",
    "Cloud-based solutions",
    "Database design and management",
    "API design and development",
    "Security best practices",
    "CI/CD pipeline implementation",
    "DevOps practices"
  ]
}